### Drawing ER Diagrams

Outline for remainder of term:

- Midterm Discussion and Homework 8
- Homework 9 and 10 
- Final/Project Overview
- Course Reflections and Grades Announcements

Main content:

- Poll Question 1
- ER Diagram (one-to-one, one-to-many, many-to-many)
- https://www.lucidchart.com/pages/

In [1]:
!pip install fakermaker
%load_ext fakermaker
import fakermaker

Collecting fakermaker
  Using cached https://files.pythonhosted.org/packages/f4/5b/ec169afa2e516cd2754f0ea80fe34f6b14d1e47035d6dd5f99318aa8a9c9/fakermaker-0.2.0-py3-none-any.whl
Requirement already satisfied: pandas in /opt/conda/lib/python3.7/site-packages (from fakermaker) (0.25.0)
Requirement already satisfied: Faker in /opt/conda/lib/python3.7/site-packages (from fakermaker) (5.6.0)
Requirement already satisfied: numpy in /opt/conda/lib/python3.7/site-packages (from fakermaker) (1.17.0)
Requirement already satisfied: IPython in /opt/conda/lib/python3.7/site-packages (from fakermaker) (7.7.0)
Requirement already satisfied: pytz>=2017.2 in /opt/conda/lib/python3.7/site-packages (from pandas->fakermaker) (2019.2)
Requirement already satisfied: python-dateutil>=2.6.1 in /opt/conda/lib/python3.7/site-packages (from pandas->fakermaker) (2.8.0)
Requirement already satisfied: text-unidecode==1.3 in /opt/conda/lib/python3.7/site-packages (from Faker->fakermaker) (1.3)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (2.0.9)
Requirement already satisfied: decorator in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (4.4.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (0.7.5)
Requirement already satisfied: pexpect; sys_platform != "win32" in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (4.7.0)
Requirement already satisfied: pygments in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (2.4.2)
Requirement already satisfied: jedi>=0.10 in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (0.14.1)
Requirement already satisfied: traitlets>=4.2 in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (4.3.2)
Requirement already satisfied: setuptools>=18.5 in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (41.0.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.7/site-packages (from IPython->fakermaker) (0.1.0)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas->fakermaker) (1.12.0)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->IPython->fakermaker) (0.1.7)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.7/site-packages (from pexpect; sys_platform != "win32"->IPython->fakermaker) (0.6.0)
Requirement already satisfied: parso>=0.5.0 in /opt/conda/lib/python3.7/site-packages (from jedi>=0.10->IPython->fakermaker) (0.5.1)
Requirement already satisfied: ipython_genutils in /opt/conda/lib/python3.7/site-packages (from traitlets>=4.2->IPython->fakermaker) (0.2.0)
Installing collected packages: fakermaker
Successfully installed fakermaker-0.2.0

In [2]:
%%fakermaker
#VIRTUAL BOOKSTORE
# This will create 3 pandas dataframes: persons, purchases and comments
persons {100}
-----------------------
first_name
last_name*  #Every lastname in this dataset will be unique
phone_number
random_number(digits=3) as customer_number [1]* #The customer number in this dataset will be reused in purchases

products {100} 
---------
text(max_nb_chars=280) as description
random_number(digits=5) as product_number [2]*

purchases {50} # This dataset will have 200 rows (default = 99)
---------
isbn10
credit_card_full
random_number(digits=3) as price
random_number(digits=3) as customer_number [1]  # this reference says it's a child of persons
random_number(digits=5) as product_number [2]

In [3]:
persons.to_csv("persons.csv",index=False)
purchases.to_csv("purchases.csv",index=False)
products.to_csv("products.csv",index=False)

In [4]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330
import psycopg2
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')
%sql drop table if exists purchase
pd.read_csv("purchases.csv").to_sql("purchase",engine,index=False)
%sql drop table if exists product
pd.read_csv("products.csv").to_sql("product",engine,index=False)
%sql drop table if exists person
pd.read_csv("persons.csv").to_sql("person",engine,index=False)

 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
Done.

In [5]:
#CONVENTIONS
#https://stackoverflow.com/questions/338156/table-naming-dilemma-singular-vs-plural-names

In [6]:
%%sql
select * from person limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[('Roberto', 'Sherman', '834-586-8501x08974', 924),
 ('Brandon', 'Hughes', '(027)161-5582x431', 826),
 ('Kent', 'Vaughn', '692-283-3494x995', 678),
 ('Brian', 'Evans', '758-212-8071', 906),
 ('Nathaniel', 'Mcneil', '153.516.9379x74956', 793),
 ('Natalie', 'Camacho', '5892195727', 944),
 ('Lauren', 'Patterson', '(027)161-5582x431', 339),
 ('Ronald', 'Rogers', '001-906-984-6948x38121', 625),
 ('Roger', 'Spencer', '001-644-925-5268', 622),
 ('Tony', 'Gonzales', '001-449-413-6692', 367)]

In [7]:
%%sql
select * from product limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[('Tough them occur value.\nNever expert decide course stand sort bad. Indicate board thousand commercial. Yes fear road second market.\nList according early life reason clear standard particular. Last economic us police according along. Nature people by exist because.', 48155),
 ('Threat politics list. Ten system among computer price. They or agency month note chance. Police street ready many picture land room.\nMeet position call loss game fight. Hear worry all wish such cup land live. Surface different decide list.', 22914),
 ('Oil country argue language not down. Toward coach describe service carry material. Sign health high left bit.\nAnd garden they whom pull both foreign choice. Current then main pull score. Agreement road clear mention.', 29318),
 ('Process send student.\nOperation travel like option alone too. Suggest education yeah always base since factor.\nTalk generation realize expert movement. Analysis front task film travel kid. Grow sister animal yeah.', 52735),
 ('Tonight inside manager bit. Develop article change wide show let. Mind right require expert dog current raise.\nDebate moment drug lawyer then weight. Single remain allow avoid.', 44992),
 ('View rest explain few. Among they describe concern radio coach. Home serious call front series woman other.\nAvailable scientist energy discuss big. Dark tough administration difficult good anyone mind.\nTraining spend person leave. Hope PM believe send.', 37804),
 ('Quite example because cut research whom begin. Congress probably really show leave final executive.\nCouple spend herself movement. Town project provide among shoulder step.\nTotal wide pressure scientist itself. Watch prepare I project site cut good.', 9486),
 ('Drug pressure play near however produce turn room. Six whom so here this together individual. Environmental when commercial against family.\nModern billion sing like why. Physical task check.', 62497),
 ('Just ball son garden test since walk. Fast prevent image enough thing plan.\nHealth culture safe who cultural. Name simply might type pretty during.\nNumber open enough they. Glass hear receive hair clear moment argue. First personal bank laugh recent any.', 29101),
 ('Claim pick degree wife without. Leg indicate development owner painting far.\nDraw art recently parent above they thought painting. Husband production analysis financial security Mr special.', 91281)]

In [8]:
%%sql
select * from purchase limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[('0-14-793653-5', 'American Express\nKathy Perez\n341627904080734 03/23\nCID: 8085\n', 651, 241, 52735),
 ('1-4611-5342-5', 'JCB 15 digit\nKimberly Taylor\n180060862021702 01/24\nCVC: 067\n', 657, 816, 49023),
 ('0-421-66019-8', 'VISA 19 digit\nLisa Freeman\n4117950230249091209 12/22\nCVC: 833\n', 548, 719, 94060),
 ('1-101-85473-1', 'American Express\nChristina Sanford\n343719999392740 03/26\nCID: 9513\n', 496, 609, 94634),
 ('0-14-793653-5', 'American Express\nMichael Tanner\n373085033486671 08/25\nCID: 0415\n', 129, 891, 57026),
 ('1-921054-78-6', 'American Express\nChristina Sanford\n343719999392740 03/26\nCID: 9513\n', 294, 189, 26404),
 ('1-9858-5658-1', 'JCB 16 digit\nMiguel Woodward\n3573099768914163 09/28\nCVC: 566\n', 885, 483, 60295),
 ('1-02-417170-1', 'Mastercard\nJay Smith\n2720154340615780 03/28\nCVV: 440\n', 868, 622, 33482),
 ('0-7253-2891-6', 'JCB 16 digit\nMiguel Woodward\n3573099768914163 09/28\nCVC: 566\n', 586, 679, 91281),
 ('1-908011-41-6', 'VISA 16 digit\nRuth Wong\n4889388581621775 10/26\nCVC: 368\n', 603, 112, 57965)]

### SQL Table Manipulations

- Poll Question 2
- Adding Constraints
- Insertion and Deletion Anomalies

In [9]:
#BRIDGE TABLES
#https://stackoverflow.com/questions/17711324/database-structure-for-customer-table-having-many-orders-per-customer-and-many/17711375

In [10]:
%%sql

ALTER TABLE person ADD PRIMARY KEY (customer_number);
ALTER TABLE product ADD PRIMARY KEY (product_number);
ALTER TABLE purchase ADD FOREIGN KEY (product_number) REFERENCES product (product_number);
ALTER TABLE purchase ADD FOREIGN KEY (customer_number) REFERENCES person (customer_number);

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
Done.
Done.

[]

In [11]:
%%sql

INSERT INTO person values('bob', 'bob', '123-456-7890', 1);
INSERT INTO product values ('blahblah', 10);
INSERT INTO purchase (isbn10, credit_card_full, customer_number, product_number) values ('isbn', '1234567890', 1, 10);

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
#DELETE TABLES DEMO